{
  "overview": "This page is your central bulletin for understanding textured hair. It pulls together the big ideas behind curl patterns, porosity, density, scalp health, moisture, breakage, and everyday routines. The goal is not to give you strict rules, but to give you language and concepts so you can understand what your hair is doing and why. Once you understand your pattern, porosity, and lifestyle, you can build a routine that actually fits your real life instead of copying random routines from social media.",
  "hair_types_system": "Many guides use a number-and-letter system to describe curl patterns. The numbers 1–4 describe the broad family of texture: 1 is straight, 2 is wavy, 3 is curly, and 4 is coily or kinky. The letters A, B, and C describe how loose or tight the pattern is within each family. For example, 2A hair has a soft, loose wave, 3B hair has defined ringlets, and 4C hair has very tight coils with a lot of shrinkage. The chart is not perfect and your head can have multiple patterns, but it gives you a shared language to describe how your hair bends, shrinks, and reacts to products.",
  "curl_pattern_details": "Curl pattern affects how your hair looks and how you might style it, but it is only one part of the bigger picture. Wavy hair (Type 2) tends to lie closer to the head and can get weighed down easily by heavy products. Curly hair (Type 3) usually forms more obvious spirals and ringlets and may need both moisture and hold to keep the shape. Coily and kinky hair (Type 4) often has tight coils or zigzags, more shrinkage, and may need more deliberate moisture, gentle handling, and protective styles. Because many people have a mix of patterns on one head, it is normal to adjust products or techniques for different sections of your hair.",
  "porosity_overview": "Porosity is how easily your hair absorbs and holds onto water and products. Low-porosity hair has a tighter, smoother cuticle layer, so water and product can sit on top of the hair at first and take longer to sink in. High-porosity hair has a more open or weathered cuticle, so it absorbs moisture quickly but also loses it quickly and can feel dry again soon after wash day. Medium-porosity hair sits in the middle and usually seems easier to moisturize and maintain. Knowing your porosity helps you choose product textures, how often to clarify, and how long you might deep condition or use heat to help treatments sink in.",
  "porosity_how_to_test": "Common ways to learn about your porosity include paying attention to how your hair behaves with water and product. Low-porosity hair often takes a long time to get fully wet in the shower and beads of water may sit on top before they soak in. It may also get product buildup easily because heavy creams just sit on the surface. High-porosity hair may feel like it gets wet quickly but dries out fast, looks frizzy, or feels rough even when it has been moisturized. You do not need a perfect test or a floating-hair experiment in a cup of water; simply noticing how your hair responds over time is usually enough to get a sense of your porosity range.",
  "density_and_width": "Two other important traits are density and strand width. Density is about how many strands you have on your head overall. High-density hair looks very full and thick, while low-density hair may show more scalp, especially when parted or styled a certain way. Strand width is about how thick each individual strand is: fine, medium, or coarse. Fine strands can be more fragile and easily weighed down by heavy products, even if you have a lot of them. Coarse strands feel stronger and may tolerate richer products and more manipulation. When you combine density and width with curl pattern and porosity, you get a much clearer picture of why your hair reacts the way it does.",
  "scalp_health": "Healthy hair starts with a healthy scalp. Your scalp is skin, and it needs balance just like the skin on your face. An itchy, flaky, or very tight scalp can come from dryness, buildup, sensitivity to certain ingredients, or underlying conditions that may need a dermatologist. Gentle cleansing, not scratching aggressively with nails, rinsing products thoroughly, and avoiding heavy product buildup directly on the scalp can all help. Some people enjoy occasional scalp massages with light oils or serums, while others prefer a more minimal approach. The key is to notice what your scalp is telling you and adjust your routine instead of ignoring persistent itch, tenderness, or flakes.",
  "dryness_and_moisture": "Curls and coils often feel dry because of their shape. Natural oils from the scalp have a harder time traveling down a spiral or tight coil than they do on straight hair. Dryness can also come from using harsh shampoos frequently, skipping conditioner, not sealing in moisture after wash day, or using heat and tight styles often. Product buildup can ironically cause dryness too, because layers of product can block moisture from entering the hair shaft. A healthy moisture routine usually includes regular but gentle cleansing, a good conditioner with slip, a leave-in or cream for ongoing moisture, and a sealing step that suits your porosity and climate. Over time, consistent habits matter more than any single miracle product.",
  "breakage_vs_shedding": "All hair sheds. Shedding is when whole strands, including the root bulb, naturally fall out as part of the growth cycle. Breakage is when strands snap somewhere along the length, leaving shorter pieces and frayed ends. Shedding can increase during certain seasons, times of stress, or hormonal changes, and is often seen as full-length strands with a small white bulb at one end. Breakage often shows up as lots of short pieces, thin ends, or sections that feel rough and uneven. Breakage can come from rough detangling, tight styles, excessive heat, chemical damage, or long-term dryness. Gentle handling, regular trims, protective styles with breaks in between, and balanced moisture and protein can all help reduce breakage over time.",
  "shrinkage_and_elasticity": "Shrinkage is a sign of healthy textured hair, not damage. When curls and coils shrink up, it shows that the hair has enough elasticity to return to its natural shape after being stretched. However, shrinkage can make it harder to see true length and can contribute to tangling if strands wrap around each other. Elasticity is how far a strand can stretch and bounce back without breaking. Hair that stretches and snaps without bouncing back may need more protein or less manipulation, while hair that feels stiff and breaks easily may need more moisture. Learning to respect shrinkage, use styles that keep hair stretched when needed, and avoid pulling hair to maximum tension daily can support elasticity and length retention.",
  "washday_basics": "Wash day is where you reset your scalp and hair. A typical wash day for many curls and coils includes four main steps: cleansing, conditioning, detangling, and applying leave-in and styling products. Cleansing removes sweat, dirt, and buildup so that moisture can actually enter the hair. Conditioning adds slip and softness and is often the best time to gently detangle. After rinsing, a leave-in conditioner or cream helps maintain moisture, and a gel, mousse, or cream-gel blend can add hold and definition. The exact frequency of wash day depends on your scalp, lifestyle, and styling choices; some people wash weekly, others every 10–14 days. The goal is to find a rhythm that keeps your scalp clean and your hair hydrated without constant manipulation.",
  "cleansing": "Cleansing is about removing dirt, oil, sweat, and buildup without completely stripping your hair. Sulfate-based shampoos can be useful when there is heavy buildup or silicone use, but gentle, sulfate-free cleansers or co-washes are often enough for regular maintenance. Low-porosity or product-heavy routines may need an occasional clarifying wash to reset the hair, while high-porosity hair may prefer milder cleansers paired with rich conditioners. Focus shampoo on the scalp, not the ends, and use your fingertips or scalp brush very gently. Rinse thoroughly to avoid itch and buildup. If your hair always feels squeaky and rough after cleansing, you may need a gentler formula or to wash less frequently.",
  "conditioning_and_detangling": "Conditioner helps soften the cuticle, add slip, and make it easier to detangle. Many people detangle while the hair is coated in conditioner and saturated with water, using their fingers or a wide-tooth comb, starting from the ends and working up to the roots. Ripping through tangles from the root down is a major cause of breakage. Deep conditioners and masks add extra moisture or protein, depending on the formula. High-porosity or color-treated hair may benefit from more frequent deep conditioning, while low-porosity hair may need less frequent or shorter sessions, especially with heat. The key is to watch how your hair responds rather than following a fixed schedule from social media.",
  "leave_ins_and_sealants": "After rinsing out your conditioner, leave-in products keep moisture in your hair between wash days. Leave-in conditioners, milks, and creams add slip and lightweight moisture. Thicker creams and butters offer more lasting softness and protection for coils and protective styles. Oils and butters can help seal moisture in, especially for hair that loses water quickly, but too much heavy product can cause buildup and dullness. Low-porosity hair often prefers lighter leave-ins and careful layering, while high-porosity hair may do well with richer creams and a sealing oil on the ends. The best approach is to start with a small amount, see how your hair feels once it is dry, and adjust over time.",
  "styling_approaches": "Styling textured hair is about choosing techniques and product weights that work with your pattern, density, and lifestyle. Wavier and looser curls are often happiest with lighter foams, milks, and gels that provide definition without weighing the hair down. Tighter curls and coils often thrive with richer creams and curl-defining gels that give moisture and hold. Common styling methods include wash-and-go styles, twist-outs, braid-outs, roller sets, and stretched styles like banding. Most styles work best when hair is styled in sections on wet or damp hair, with product smoothed or raked through and then gently scrunched or twisted to encourage definition. Air drying and diffusing are both valid; the best choice is the one that fits your time, tools, and comfort level.",
  "product_categories": "Textured hair routines usually include a few main categories of products: cleansers, conditioners, leave-ins, stylers, and treatments. Cleansers include clarifying shampoos and gentle, sulfate-free shampoos or co-washes. Conditioners include daily conditioners, deep conditioners, and masks that focus on moisture or protein. Leave-ins include sprays, lotions, and creams designed to stay on the hair. Stylers include gels, mousses, custards, and creams that help define curls or hold styles in place. Treatments can include protein treatments, bond builders, scalp serums, or hot oil treatments. You do not need every category at once; most people do best with a simple set of products that meet their scalp, moisture, and styling needs.",
  "ingredients_to_know": "Many curl-friendly products rely on a mix of humectants, emollients, conditioning agents, and oils. Humectants like glycerin, honey, or aloe can attract water into the hair in certain climates. Emollients and conditioning agents help soften the hair and smooth the cuticle. Oils such as jojoba, argan, grapeseed, and avocado can help seal in moisture and add shine when used in moderation. Butters like shea or mango can be great for coarser, drier hair, while very fine hair may prefer lighter ingredients. Some people prefer to limit heavy silicones, drying alcohols, or strong sulfates because of buildup or dryness, but these ingredients are not automatically bad for everyone. It is more useful to notice how your hair responds to certain formulas than to chase perfect ingredient lists.",
  "protective_styling": "Protective styles are meant to reduce daily manipulation, protect the ends of your hair, and make routines easier. Examples include twists, braids, updos, wigs, and extensions. A good protective style should not be painfully tight, should not leave your scalp sore or inflamed, and should allow you to keep your scalp clean and moisturized. Leaving a protective style in for too long or neglecting your hair underneath can lead to tangles, buildup, and breakage when you take it down. It is usually helpful to give your hair a break between long-term styles, trim when needed, and be very gentle during takedown and detangling.",
  "heat_and_chemical_treatments": "Heat tools and chemical services are personal choices that come with trade-offs. Blow-drying, flat ironing, and curling irons can make styling simpler or create certain looks, but frequent high heat without protection can weaken the cuticle and lead to dryness and breakage over time. Using a heat protectant and keeping the temperature as low as possible helps reduce damage. Chemical treatments like relaxers, texturizers, perms, or permanent color change the structure of the hair and can make it more fragile. If you choose to use heat or chemicals, your routine may need more protein, moisture, and trims to keep your hair strong and flexible.",
  "length_retention": "Most people’s hair grows, but not everyone retains length at the ends. Length retention is about keeping the hair you grow from breaking off. Breakage can come from rough detangling, tight styles, constant friction, long-term dryness, or chemical and heat damage. Supporting length retention usually includes regular trims to remove thin ends, gentle detangling in sections, protective or low-manipulation styles, and consistent moisture and protein balance. It also often involves protecting the ends of the hair from rubbing on clothes or pillows and being realistic about how often you can restyle your hair without causing stress.",
  "nighttime_care": "Nighttime care helps protect your hair from friction and dryness while you sleep. Cotton pillowcases can absorb moisture and rough up the hair cuticle. Many people switch to satin or silk pillowcases, bonnets, or scarves to reduce friction and breakage. Pineappling (gathering hair loosely at the top of the head), loose braids, or twists can help preserve definition overnight for curls and coils. The exact method depends on your length, pattern, and how you like your hair to look in the morning. The goal is to prevent excessive tangling and dryness, not to create a perfect style every night.",
  "common_mistakes": "Common mistakes with textured hair include using very harsh shampoos too often, skipping conditioner, rough detangling from roots to ends, overloading the hair with heavy products that never fully rinse out, and expecting a new product to fix long-term habits overnight. Other frequent issues include tight protective styles that cause tension headaches or breakage around the edges, using high heat frequently without heat protectant, and trying to copy routines from people with completely different hair types, climates, or lifestyles. It is normal to experiment, but pay attention to how your hair and scalp feel week to week. Small, consistent changes usually matter more than chasing trends.",
  "building_a_routine": "Building a routine starts with honest observation. Pay attention to your pattern, porosity, density, and scalp. Notice how long your hair takes to get wet, how quickly it dries, which products feel heavy or light, and how your hair looks a day or two after wash day. From there, create a simple core routine: a cleanser, a conditioner, a leave-in, and one or two stylers. Decide how often you will realistically wash your hair, how much time you can spend on wash day, and whether you prefer wash-and-go styles, stretched styles, or protective styles. As you learn what works, you can adjust steps, add treatments, or simplify. The goal is not perfection; it is a repeatable routine that respects your hair’s needs and your energy level.",
  "library_cards": [
    {
      "id": "straight_fine_oiliness",
      "title": "Straight + Fine + Oiliness",
      "tags": ["straight", "fine", "oiliness"],
      "summary": "Fine straight hair can get oily at the roots quickly and feel flat if product layers build up. Focus on scalp cleansing and lightweight conditioning.",
      "do": [
        "Cleanse the scalp regularly with a gentle shampoo that rinses clean",
        "Condition mids-to-ends only to avoid greasy roots",
        "Clarify every 1–2 weeks if you use lots of styling products"
      ],
      "dont": [
        "Layer heavy oils or butters at the roots",
        "Over-condition the scalp area",
        "Skip cleansing and rely on buildup-covering products"
      ],
      "routine": {
        "washDay": [
          "Shampoo scalp (rinse thoroughly)",
          "Light conditioner on lengths/ends",
          "Optional lightweight leave-in on ends only"
        ],
        "between": [
          "Rinse or refresh ends if needed",
          "Use a light serum only on dry ends (small amount)"
        ]
      }
    },
    {
      "id": "wavy_medium_frizz",
      "title": "Wavy + Medium + Frizz",
      "tags": ["wavy", "medium", "frizz"],
      "summary": "Wavy hair often needs a balance of moisture and hold. Too-heavy products can weigh it down, but no hold can lead to frizz and undefined waves.",
      "do": [
        "Use a lightweight leave-in or milk on damp hair",
        "Add a gel or mousse for hold, then scrunch",
        "Dry with minimal touching (air dry or diffuse)"
      ],
      "dont": [
        "Use heavy butters as an all-over styler",
        "Brush dry waves without re-wetting first",
        "Touch hair constantly while drying"
      ],
      "routine": {
        "washDay": [
          "Gentle cleanse",
          "Condition and detangle",
          "Light leave-in + mousse/gel, scrunch, dry"
        ],
        "between": [
          "Refresh with water mist + tiny amount of styler",
          "Scrunch and let it set again"
        ]
      }
    },
    {
      "id": "curly_medium_heat_damage",
      "title": "Curly + Medium + Heat Damage",
      "tags": ["curly", "medium", "heat"],
      "summary": "Heat damage can show up as frizz, limp curls, or sections that won’t clump. Rebuild with gentle care, moisture, and occasional protein.",
      "do": [
        "Use heat protectant whenever you apply heat",
        "Deep condition regularly for softness and slip",
        "Use light-to-moderate protein if hair feels overly stretchy"
      ],
      "dont": [
        "Keep using high heat weekly with no protection",
        "Detangle aggressively on dry hair",
        "Ignore split ends if they keep traveling upward"
      ],
      "routine": {
        "washDay": [
          "Cleanse scalp",
          "Condition and detangle in sections",
          "Leave-in + curl styler with hold, set and dry"
        ],
        "between": [
          "Refresh with water + leave-in",
          "Avoid repeated heat; choose low-manipulation styles"
        ]
      }
    },
    {
      "id": "coily_coarse_dryness_breakage",
      "title": "Coily + Coarse + Dryness/Breakage",
      "tags": ["coily", "coarse", "dryness", "breakage"],
      "summary": "Coily hair often needs deliberate moisture and gentle handling. Focus on slip, sealing the ends, and reducing daily manipulation.",
      "do": [
        "Detangle with conditioner in sections, starting at the ends",
        "Use a moisturizing leave-in and seal ends if needed",
        "Choose low-manipulation or protective styles with breaks in between"
      ],
      "dont": [
        "Rip through tangles from root to end",
        "Leave hair unprotected against friction every night",
        "Wear styles that feel painfully tight or cause scalp soreness"
      ],
      "routine": {
        "washDay": [
          "Cleanse scalp (gentle shampoo)",
          "Condition and detangle with slip",
          "Leave-in + cream, then seal ends (light oil if tolerated)"
        ],
        "between": [
          "Light moisture refresh on ends",
          "Protect at night with satin/silk + low-tension style"
        ]
      }
    },
    {
      "id": "low_porosity_buildup",
      "title": "Low Porosity + Buildup",
      "tags": ["low", "frizz"],
      "summary": "Low-porosity hair can feel dry when product layers sit on top. The fix is often better cleansing + lighter layering, not more product.",
      "do": [
        "Use warm water and thorough rinsing",
        "Clarify occasionally to remove buildup",
        "Use lighter leave-ins and smaller amounts"
      ],
      "dont": [
        "Stack heavy creams and oils repeatedly without cleansing",
        "Assume more product automatically means more moisture",
        "Ignore scalp buildup and itch"
      ],
      "routine": {
        "washDay": [
          "Clarify as needed (not every wash)",
          "Condition with slip",
          "Light leave-in; keep layers minimal"
        ],
        "between": [
          "Refresh with water-based mist first",
          "Add a tiny amount of product only if needed"
        ]
      }
    }
  ]
}
