{
  "overview": "This library is built for men’s hair and scalp health across all textures — straight, wavy, curly, and coily. It covers short hair routines, fades, waves, curls, braids, locs, and common concerns like dandruff, thinning, ingrown hairs, and scalp irritation. Pick a topic to view a focused guide. While hair science is universal, this library highlights what changes when hair is short, grooming involves clippers or razors, or scalp health is the primary concern.",

  "hair_types_system": "Hair texture generally falls into four families: Type 1 straight, Type 2 wavy, Type 3 curly, and Type 4 coily/kinky. The A/B/C letters describe how loose or tight the pattern is. Straight hair (Type 1) can still experience dryness, oiliness, breakage, or thinning. Wavy hair (Type 2) often frizzes easily and benefits from lightweight moisture and controlled styling. Curly hair (Type 3) needs hydration and hold for definition. Coily hair (Type 4) typically needs more moisture and low-manipulation routines. Many people have more than one type on their head — this system is a guide, not a rule.",

  "curl_pattern_details": "To identify your pattern, wash your hair and let it air-dry with minimal product. Straight hair lays flat, wavy hair forms loose S-shapes, curly hair forms spirals, and coily hair forms tight coils or zig-zags. Pattern helps with styling choices, but porosity, density, and strand width often matter more for product selection and routine success.",

  "scalp_health": "For many men, scalp health is the foundation of any routine. Common issues include dryness, flakes, oiliness, irritation, and buildup from styling products. Healthy scalp habits include regular cleansing, avoiding excessive oil layering, using clean tools, and paying attention to irritation early. If your scalp feels sore, inflamed, or itchy for long periods, it may need targeted care beyond basic shampooing.",

  "dandruff_and_flakes": "Not all flakes are dandruff. Dryness, product buildup, or irritated skin can all cause flaking. If flakes are light and powdery, dryness or buildup may be the issue. If flakes are thicker, greasy, itchy, or persistent, a dandruff-like condition may be present. Helpful steps include consistent scalp cleansing, reducing heavy pomades and oils, avoiding very hot water, and clarifying occasionally if you use styling products often. Persistent or painful flaking may require professional guidance.",

  "product_buildup_and_pomades": "Pomades, waxes, heavy creams, and oils are common in men’s styling but can easily lead to buildup. Buildup can cause flakes, itching, dullness, and irritation. If you use heavy stylers, wash the scalp consistently and clarify occasionally. Avoid applying oil on top of buildup, and be cautious mixing heavy oils under certain gels, which often causes white residue.",

  "hair_loss_and_thinning": "Hair loss and thinning can be influenced by genetics, stress, scalp inflammation, tight styles, or health factors. Early signs include thinning at the crown or temples, excessive shedding, or widening parts. Practical steps include keeping the scalp clean and calm, avoiding tight or aggressive styling, reducing harsh chemicals and heat, and monitoring changes over time. Sudden, patchy, or painful hair loss should be evaluated by a professional.",

  "hairline_and_edges": "Hairline sensitivity is common with frequent line-ups, tight braids, or aggressive brushing. To protect edges, avoid constant sharp line-ups, reduce tension styles, and keep the area moisturized without over-greasing. Redness, bumps, or flaking around the hairline often signal irritation or buildup rather than a need for more oil.",

  "ingrown_hairs_and_razor_bumps": "Ingrown hairs are common when hair curls back into the skin after shaving or trimming. They are often caused by shaving too closely, dull blades, stretching the skin, or shaving against the grain. Helpful habits include using clean, sharp tools, trimming instead of shaving too close, and keeping the skin clean and calm. Persistent or painful bumps may benefit from professional care.",

  "beard_care": "Beard care combines skin care and hair care. Clean the beard area regularly, condition lightly, and use minimal oil if the skin feels dry. Flaking under the beard can come from dryness or buildup. Ingrown hairs in the beard area are often improved by trimming instead of close shaving and keeping tools clean.",

  "porosity_overview": "Porosity describes how easily hair absorbs and retains moisture. Low-porosity hair may resist water and build up products easily. High-porosity hair absorbs moisture quickly but loses it quickly and often frizzes. Medium porosity tends to be easiest to manage. Understanding porosity helps determine product weight and conditioning frequency.",

  "porosity_how_to_test": "Rather than relying on inconsistent water tests, use observation. Hair that takes a long time to get wet and feels coated may be low porosity. Hair that dries very quickly and frizzes easily may be high porosity. If unsure, treat hair like medium porosity and adjust based on results.",

  "density_and_width": "Density refers to how much hair you have on your scalp, while strand width refers to the thickness of individual hairs. Fine hair is easily weighed down and benefits from lighter products. Coarse hair can tolerate richer products. Low-density hair often benefits from volume-friendly styling, while high-density hair benefits from sectioning and thorough conditioning.",

  "dryness_and_moisture": "Dry hair lacks moisture, while frizz often indicates a need for better hydration or styling technique. Straight and wavy hair typically needs lightweight moisture. Curly and coily hair usually needs more conditioning and may benefit from leave-ins. If hair feels stiff or dull, add moisture. If hair feels greasy or coated, reduce heavy products and clarify occasionally.",

  "breakage_vs_shedding": "Shedding is normal hair loss from the root, while breakage is hair snapping along the strand. Breakage is commonly caused by dryness, aggressive brushing, harsh cleansers, tight styles, excessive heat, or chemical damage. Improving conditioning, reducing friction, and handling hair gently helps reduce breakage.",

  "washday_basics": "A simple structure works for most men: cleanse, condition, then style or moisturize. Short hair routines are quicker, while longer or curlier hair benefits from more conditioning time. Consistency matters more than complexity.",

  "cleansing": "Choose cleansers based on scalp condition and product use. Frequent pomade or wax use may require stronger cleansing occasionally. Straight or oily hair may need more frequent washing. Curly or coily hair often benefits from less frequent washing with stronger conditioning. Avoid very hot water, which can worsen dryness and irritation.",

  "conditioning_and_detangling": "Conditioning matters even for short hair. Straight and wavy hair benefits from lightweight conditioners that reduce friction. Curly and coily hair benefits from detangling with conditioner using fingers or a wide-tooth comb. Avoid aggressive brushing, especially on dry curls.",

  "leave_ins_and_sealants": "Leave-ins provide moisture; sealants help lock it in. Straight and wavy hair typically needs very light leave-ins and minimal oil. Curly and coily hair often benefits from leave-ins after washing. If flakes occur, reduce layering and reassess product combinations.",

  "styling_approaches": "Men’s styling goals often include clean shape, definition, volume control, or waves. Straight hair styling focuses on shape and scalp comfort. Wavy hair styling focuses on frizz control and light hold. Curly hair styling emphasizes hydration and definition. Coily hair styling emphasizes moisture and low manipulation. Lighter stylers help maintain a clean look without buildup.",

  "product_categories": "Common product categories include gentle shampoo, clarifying shampoo, conditioner, leave-in, curl cream, gel, mousse, pomade or wax, lightweight oils, and scalp-focused treatments. Choose products by function rather than brand labels.",

  "ingredients_to_know": "Helpful ingredients include glycerin, aloe, panthenol, lightweight oils like jojoba or argan, and proteins used in moderation. Potential irritants include harsh sulfates on dry hair, heavy petrolatum layering that causes buildup, strong drying alcohols, and heavy fragrance for sensitive scalps.",

  "protective_styling": "Protective styling for men can include braids, cornrows, twists, locs, or low-manipulation routines. Protective styles should never be painful or overly tight. Clean the scalp regularly, moisturize lightly, and avoid leaving styles in too long without maintenance.",

  "heat_and_chemical_treatments": "Heat and chemicals affect all hair types. Signs of damage include increased breakage, rough texture, loss of curl pattern, and persistent frizz. Use heat protection, reduce frequency of hot tools, and prioritize conditioning if you color or chemically treat hair.",

  "length_retention": "Men growing their hair out should focus on preventing breakage rather than avoiding trims entirely. Gentle detangling, consistent conditioning, reduced heat, and lower friction help retain length over time.",

  "nighttime_care": "Night routines reduce friction and dryness. Short hair benefits from satin pillowcases. Longer hair benefits from bonnets or satin scarves. Avoid heavy nighttime product use if you experience buildup or flakes.",

  "common_mistakes": "Common mistakes include excessive pomade or oil use, skipping conditioner, using harsh shampoo too frequently, brushing curls dry, tight styles that stress edges, shaving too closely, and changing routines too often.",

  "building_a_routine": "Build a routine that fits your lifestyle. Minimal routines focus on cleansing, conditioning, and light styling. Medium routines add leave-ins and targeted styling. Detailed routines include deep conditioning, clarifying, and structured style maintenance.",

  "short_hair_routine": "For very short hair, prioritize scalp health and light products. A simple routine includes cleansing, light conditioning, minimal moisturizing if needed, and a light styler for shape. Avoid piling oils on the scalp.",

  "barber_tips": "Communicate clearly with your barber. Explain whether you are maintaining length, growing hair out, or supporting a specific pattern like waves or curls. Avoid overly aggressive line-ups if your hairline is sensitive. Clean tools and gentle aftercare reduce irritation.",

  "waves_and_definition": "Wave and curl definition routines should prioritize a clean scalp, consistent conditioning, light moisturizers, and light hold products. Heavy oils and pomades often cause buildup and flakes. Gentle brushing or defining techniques produce better long-term results.",

  "when_to_get_help": "Seek professional help if you experience sudden hair loss, patchy bald spots, painful or inflamed scalp, thick scaling, pus-filled bumps, or rapid shedding. Early intervention often leads to better outcomes."
}
